I have implemented a standalone "citrixadc_appfwsignatures" not bound to any WAF Profile. 
Everytime i do a terraform apply the citrixadc provider wants ro replace as follows

 # module.netscaler-adc-waf-webapp_test_company_com.citrixadc_appfwsignatures.app_waf must be replaced
-/+ resource "citrixadc_appfwsignatures" "app_waf" {
      + action                  = (known after apply) # forces replacement
      + autoenablenewsignatures = (known after apply)
      + category                = (known after apply)
      + enabled                 = (known after apply)
      ~ id                      = "waf_sig_webapp-test.company.com" -> (known after apply)
      + mergedefault            = (known after apply)
        name                    = "waf_sig_webapp-test.company.com"
      + ruleid                  = (known after apply) # forces replacement
      + sha1                    = (known after apply)
      + vendortype              = (known after apply)
      + xslt                    = (known after apply)
        # (5 unchanged attributes hidden)
    }


When the terraform apply completes followed by another terraform apply it wants to do as follows again

 # module.netscaler-adc-waf-webapp_test_company_com.citrixadc_appfwsignatures.app_waf must be replaced
-/+ resource "citrixadc_appfwsignatures" "app_waf" {
      + action                  = (known after apply) # forces replacement
      + autoenablenewsignatures = (known after apply)
      + category                = (known after apply)
      + enabled                 = (known after apply)
      ~ id                      = "waf_sig_webapp-test.company.com" -> (known after apply)
      + mergedefault            = (known after apply)
        name                    = "waf_sig_webapp-test.company.com"
      + ruleid                  = (known after apply) # forces replacement
      + sha1                    = (known after apply)
      + vendortype              = (known after apply)
      + xslt                    = (known after apply)
        # (5 unchanged attributes hidden)
    }
